; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	thermograph3 - mode
	image2 - mode
	infrared1 - mode
	image6 - mode
	thermograph5 - mode
	image4 - mode
	infrared0 - mode
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation7 - direction
	Star1 - direction
	GroundStation6 - direction
	Star0 - direction
	GroundStation5 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 image4)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star1)
	(supports instrument1 image4)
	(supports instrument1 thermograph5)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
	(supports instrument2 image6)
	(supports instrument2 thermograph5)
	(supports instrument2 image2)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star0)
	(supports instrument3 infrared1)
	(supports instrument3 image6)
	(calibration_target instrument3 Star0)
	(supports instrument4 infrared0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(pointing satellite0 GroundStation7)
	(have_image Planet8 infrared1)
	(have_image Planet8 image6)
	(have_image Phenomenon9 infrared0)
	(have_image Phenomenon9 thermograph3)
	(have_image Planet10 thermograph5)
	(have_image Planet10 image4)
	(have_image Star11 infrared0)
	(have_image Star11 thermograph3)
	(have_image Phenomenon12 thermograph5)
	(have_image Phenomenon12 image4)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 11
2. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 1 of 11
3. (turn_to satellite1 star11 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star11)
   goals met: 1 of 11
4. (take_image satellite1 star11 instrument2 thermograph3)
   added: (have_image star11 thermograph3)
   goals met: 2 of 11
5. (turn_to satellite1 planet8 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 planet8)
   goals met: 2 of 11
6. (take_image satellite1 planet8 instrument2 image6)
   added: (have_image planet8 image6)
   goals met: 3 of 11
7. (turn_to satellite1 phenomenon9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 11
8. (turn_to satellite0 groundstation5 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 groundstation5)
   goals met: 2 of 11
9. (take_image satellite1 phenomenon9 instrument2 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 3 of 11
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 11
11. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 3 of 11
12. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 3 of 11
13. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 3 of 11
14. (turn_to satellite0 phenomenon12 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 11
15. (take_image satellite0 phenomenon12 instrument1 image4)
   added: (have_image phenomenon12 image4)
   goals met: 4 of 11
16. (take_image satellite0 phenomenon12 instrument1 thermograph5)
   added: (have_image phenomenon12 thermograph5)
   goals met: 5 of 11
17. (turn_to satellite0 planet10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet10)
   goals met: 5 of 11
18. (take_image satellite0 planet10 instrument1 image4)
   added: (have_image planet10 image4)
   goals met: 6 of 11
19. (take_image satellite0 planet10 instrument1 thermograph5)
   added: (have_image planet10 thermograph5)
   goals met: 7 of 11
20. (turn_to satellite0 groundstation7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation7)
   goals met: 8 of 11
21. (turn_to satellite1 groundstation5 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 groundstation5)
   goals met: 8 of 11
22. (calibrate satellite1 instrument4 groundstation5)
   added: (calibrated instrument4)
   goals met: 8 of 11
23. (turn_to satellite1 phenomenon9 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 phenomenon9)
   goals met: 8 of 11
24. (take_image satellite1 phenomenon9 instrument4 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 9 of 11
25. (turn_to satellite1 planet8 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet8)
   goals met: 9 of 11
26. (take_image satellite1 planet8 instrument4 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 10 of 11
27. (turn_to satellite1 star11 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star11)
   goals met: 10 of 11
28. (take_image satellite1 star11 instrument4 infrared0)
   added: (have_image star11 infrared0)
   goals met: 11 of 11
